emacs/.config/emacs/literator.org
#+TITLE: Troy's Literate Config
#+author: Troy Brumley
#+email: BlameTroi@gmail.com
#+language: en
#+options: ':t toc:nil num:t author:t email:t
#+startup: content
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

/This is my literate Emacs configuration file.
There are many like it, but this one is mine./

This is an attempt at a literate configuration rewrite of my current
(2024) Emacs Lisp configuration.


* The early-init.el file


** The standard intro

All Emacs Lisp files are expected to conform to certain standards.
I'll try to honor them all with the exception that I will leave
dangling closing parentheses in some of the code. This makes it easier
to spot indentation and nesting errors across code blocks.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;;; early-init.el --- Troy Brumley's early-init.el -*- no-byte-compile: t; lexical-binding: t; -*-

;;; Commentary:

;; Copyright (C) 2024-2025 Troy Brumley (aka Troi)

;; Author: Troy Brumley <blametroi@gmail.com>

;; All rights reserved.

;; This file is NOT part of GNU Emacs. The author considers it to be
;; in the public domain.
;;
;; This file is generated from an Org document. That file should be
;; found in the same directory as this in my "dotfiles" repository.

;; I borrow liberally from Protesilaos "Prot" Stavrou's highly
;; instructive literal configuration found on his website:
;;
;; https://protesilaos.com/emacs/dotemacs
;;
;; The clever bits in here are likely from his config. I have changed
;; some names to avoid confusing myself, but I'm not trying to claim
;; his code. Hopefully I've marked these well enough.

;; The Emacs early initialization can include most anything that
;; doesn't:
;;
;; 1) Require `use-package' or `require'.
;; 2) Involve or change the visual frames and windows of Emacs.

;;; Code:

#+end_src


** Garbage Collection

Essentially turn off garbage collection for startup. We will turn it
back on again when we're finished.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; Turn off garbage collection during startup.

(defvar troi/gc-cons-threshold gc-cons-threshold)
(defvar troi/gc-cons-percentage gc-cons-percentage)
(setopt gc-cons-threshold most-positive-fixnum)
(setopt gc-cons-percentage 1.0)

#+end_src

This is probably no longer useful on modern systems, but having Emacs
do a garbage collection if I leave Emacs shouldn't hurt. The hook for
this is defined here, it will be activated later.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; Force a garbage collection if I leave Emacs temporarily.

(defun troi/gc-after-focus-change ()
  "Run GC when frame loses focus."
  (run-with-idle-timer
   5 nil
   (lambda () (unless (frame-focus-state) (garbage-collect)))))

#+end_src


** File and source control handlers

Emacs has special handling for some file names. We touch enough files
during startup that disabling that handler temporarily is worth while.

Emacs defaults to being able to recognize/integrate with any source
control system. I only use Git. As with the file name handler I remove
all of the but Git. This change is permanent.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; Turn of special file name handling during startup.

(defvar troi/file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

;; The only vcs I use is Git. I save the original back-ends list
;; but don't plan to restore it.

(defvar troi/vc-handled-backends vc-handled-backends)
(setopt vc-handled-backends '(Git))

#+end_src


** Obliterate the touch-pad

I do almost all of my work on a MacBook (M2). The touch-pad on Macs is
overly sensitive and has a bunch of gestures that I can't remember.
Combined with my imprecise typing and tendency to rest my wrists on my
keyboard I constantly find the pointer moving and jumping and firing
various events.

I needed to make some adjustment to the mouse/touch-pad sensitivity but
couldn't find anything. There is the 'disable-mouse' package but it
doesn't quite get do it right for me. And I ran into a couple of cases
where it left me unable to use Emacs (some popup hidden behind the
main frame).

This function is heavy handed, but it works with the help of a few
tweaks further on.

#+begin_src emacs-lisp :tangle "new-early-init.el"
(defun troi/bad-mouse-stop-that ()
  "Disable the mouse/touch-pad.
This function aggressively swats mouse/touchpad in an attempt
to prevent the Mac track-pad from causing motion when I
inevitably brush it. I am setting it twice, both in
`emacs-startup-hook' and `after-init-hook' because I know of
at least one package that needs `mouse-wheel-mode' turned off
during init and because something else during init overwrites
my `wheel-down' overrides."

  (global-set-key [wheel-up] 'ignore)
  (global-set-key [double-wheel-up] 'ignore)
  (global-set-key [triple-wheel-up] 'ignore)
  (global-set-key [wheel-down] 'ignore)
  (global-set-key [double-wheel-down] 'ignore)
  (global-set-key [triple-wheel-down] 'ignore)
  (global-set-key [wheel-left] 'ignore)
  (global-set-key [double-wheel-left] 'ignore)
  (global-set-key [triple-wheel-left] 'ignore)
  (global-set-key [wheel-right] 'ignore)
  (global-set-key [double-wheel-right] 'ignore)
  (global-set-key [triple-wheel-right] 'ignore)
  (mouse-wheel-mode -1)
  (message "track-pad stuff set to ignore"))

#+end_src

Originally I only invoked this function from `emacs-startup-hook'. I
later discovered that `pixel-scroll-precision-mode' overwrites a few
wheel/button combinations, but not all of them. It does this
regardless of `mouse-wheel-mode'.

This led to mouse scrolling being partially on in Org when using
`visual-fill-column-mode'.

On chance that something else during =init.el= might do something
similar to this, I also add the function to the `after-init-hook'.

#+begin_src emacs-lisp :tangle "new-early-init.el"
(add-to-list
 'emacs-startup-hook #'troi/bad-mouse-stop-that)
(add-to-list
 'after-init-hook #'troi/bad-mouse-stop-that)

#+end_src


** Move the mouse pointer out of the way

And even after all of the above, the touchpad still responds to some
accidental contact. The best solution I've found so far is to banish
the mouse pointer to the lower right corner of my display, moved up a
bit so it doesn't trigger the Mac start bar.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; Park the mouse pointer in an inoffensive location.

(mouse-avoidance-mode 'banish)
(setopt mouse-avoidance-banish-position
	'((frame-or-window . frame) (side . right) (side-pos . 1)
	  (top-or-bottom . bottom) (top-or-bottom-pos . 15)))

#+end_src


** The keyboard layout and remapping

The Mac keyboard layout is annoyingly different from a PC keyboard
layout, and neither layout matches those that influenced the design of
Emacs.

Changing <CAPS LOCK> to be <CONTROL> in OS settings is something I do
automatically on any system.

Emacs has the ability to remap keys itself (see Customization Group
`Ns') but I prefer doing that outside of Emacs.

The bottom row of a 'standard' keyboard holds all the keys that might
need remapping. Using 'Karbiner' I have remapped them as follows:

| Original | Remapped             |
|----------+----------------------|
| fn       | control              |
| control  | fn                   |
| option   | command (or super)   |
| command  | alt                  |
| spacebar | unchanged            |
| command  | unchanged            |
| option   | unchanged            |
|----------+----------------------|

I had to retrain my fingers for using this mapping outside of Emacs,
but it wasn't difficult.


** Settings needed before the frame is created

These all lump together without much in the way of obvious groupings
that warrant their own section headers.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; These set the frame on my Mac to 'real' full-screen.

(setopt frame-inhibit-implied-resize t)
(setopt frame-resize-pixelwise t)
(setopt window-resize-pixelwise t)
(setopt initial-frame-alist '((fullscreen . fullboth)
			      (ns-appearance . dark)
			      (ns-transparent-titlebar . t)))
(setopt default-frame-alist '((fullscreen . fullboth)
                              (ns-appearance . dark)
                              (ns-transparent-titlebar . t)))

;; Use standard Emacs UI elements and not OS tailored ones.

(setopt use-dialog-box nil)
(setopt use-file-dialog nil)
(setopt use-short-answers t)

;; Quiet down the startup, I want to open up in *scratch*.

(setopt inhibit-splash-screen t)
(setopt inhibit-startup-screen t)
(setq inhibit-x-resources t)       ; x includes windows registry and ns here
(setopt inhibit-startup-echo-area-message user-login-name)
(setopt inhibit-startup-buffer-menu t)

;; I'm not sure I should stick with this, but for now I do.

(setopt confirm-kill-processes nil)

;; I leave the menu bar active but hidden. The scroll and tool
;; bars are hidden.

(menu-bar-mode)        ; it's tucked out of the way in MacOS
(setopt ns-auto-hide-menu-bar t)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(context-menu-mode -1)

#+end_src


** Compiler warnings and use of native compilation

This is a good place to turn off several warnings that are of no real
use to me. Byte compiling and Native Compiling either work or they
don't.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; Silence warnings that aren't relevant during normal sessions.

(setq byte-compile-warnings '(not obsolete))
(setq warning-suppress-log-types '((comp) (bytecomp)))
(setopt native-comp-async-report-warnings-errors 'silent)

#+end_src

Enable native compilation if it is available.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; Enable native compilation if it is available.

(if (and (fboundp 'native-compile-available-p)
         (native-compile-available-p))
    (setopt package-native-compile t)
  (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28
  (setq native-compile-prune-cache t)) ; Emacs 29

#+end_src


** Lest we forget

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; Metadata and stragglers.

(setopt user-full-name "Troy Brumley")
(setopt user-mail-address "BlameTroi@gmail.com")
(setopt auth-sources '("~/.authinfo.gpg"))
(setopt auth-source-cache-expiry nil)

#+end_src


** Increase the inter-process communications buffer allocation.

One last optimization is to increase the size of the inter-process
communications buffer. Its default of 4k on some systems is too low. I
believe the default is 16K on MacOS. It is not clear how large it can
be, but this setting works.

This improves performance of some `eshell' based commands. I don't
know what it's maximum size can be on MacOS but I've never had a
problem with this setting. In Linux the maximum is known to be
~/proc/sys/fs/pipe-max-size~. Reading about this for the Mac says it
starts at 16k and can be set up to 64k. It isn't clear what should
happen when over allocated.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; The default is 4K or 16K. 64K is the max for a Mac.

(setq read-process-output-max (* 64 1024))

#+end_src


** I don't like Customization writing to =init.el=

Finally, I don't like the way the Emacs Easy Customization writes into
the =init.el= file. Thankfully we can direct customizations to a
separate file parallel to the init.

The customization UI is a great tool for exploring and testing
options, and useful changes can be persisted to the custom file.

I don't load those customizations. I do review them and pull anything
useful into my hand crafted configuration.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; The Customization Interface and file.

(setopt custom-file (concat user-emacs-directory "i_dont_load_my_custom.el"))

;; If you need to, uncomment the following line.
;; (load custom-file)

#+end_src


** Move the Native Compile cache into a no-littering directory

The no-littering package cleans up the .emacs.d (or .config/emacs ...)
directory by adding etc/ and var/ sub-directories and moving a lot of
state and settings under them.

The eln-cache/ directory holds natively compiled packages.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; emacs collective's no littering recommendation

(when (and (fboundp 'startup-redirect-eln-cache)
           (fboundp 'native-comp-available-p)
           (native-comp-available-p))
  (startup-redirect-eln-cache
   (convert-standard-filename
    (expand-file-name  "var/eln-cache/" user-emacs-directory))))

#+end_src


** Set after init hooks to restore garbage collection settings

The `emacs-startup-hook' runs after =init.el= and is a good place
to restore handlers and garbage collection settings while also
setting the hook for garbage collection on focus change.

#+begin_src emacs-lisp :tangle "new-early-init.el"
;; Restore garbage collection and file name handler once startup
;; completes. We also plug in the idle time garbage collection
;; trigger.

(add-hook
 'emacs-startup-hook
 (lambda ()
   ;; These were hard coded as 8 Mb and 20%.
   (setopt gc-cons-threshold troi/gc-cons-threshold)
   (setopt gc-cons-percentage troi/gc-cons-percentage)
   (setq   file-name-handler-alist troi/file-name-handler-alist)
   (message "gc-cons-threshold & file-name-handler-alist restored")
   (when (boundp 'after-focus-change-function)
     (add-function
      :after after-focus-change-function
      #'troi/gc-after-focus-change))))

#+end_src


** The standard outro

#+begin_src emacs-lisp :tangle "new-early-init.el"

(provide 'early-init)
;;; File early-init.el ends here.
#+end_src





* The init.el file

Here we finish tweaks to settings and load the packages that make this
Emacs my Emacs.


** The standard intro

#+begin_src emacs-lisp :tangle "new-init.el"
;;; init.el --- Troy Brumley's init.el -*- no-byte-compile: t; lexical-binding: t; -*-

;;; Commentary:

;; Copyright (C) 2024-2025 Troy Brumley (aka Troi)

;; Author: Troy Brumley <blametroi@gmail.com>

;; All rights reserved.

;; the same directory as this in my "dotfiles" repository.
;; This file is NOT part of GNU Emacs. The author considers it to be
;; in the public domain.
;;
;; This file is generated from an Org document. That file should be
;; found in the same directory as this in my "dotfiles" repository.

;; I borrow liberally from Protesilaos "Prot" Stavrou's highly
;; instructive literal configuration found on his website:
;;
;; https://protesilaos.com/emacs/dotemacs
;;
;; The clever bits in here are likely from his config. I have changed
;; some names to avoid confusing myself, but I'm not trying to claim
;; his code. Hopefully I've marked these well enough.

;; The `init.el' file is run after `early-init.el'. Here we initialize
;; Emacs 'the application'. Establish package repositories, themes,
;; fonts, visual settings, and load and configure packages.

;;; Code:

#+end_src


