emacs/.config/emacs/new-init.el
;;; init.el --- Troy Brumley's init.el -*- no-byte-compile: t; lexical-binding: t; -*-

;;; Commentary:

;; Copyright (C) 2024-2025 Troy Brumley (aka Troi)

;; Author: Troy Brumley <blametroi@gmail.com>

;; All rights reserved.

;; the same directory as this in my "dotfiles" repository.
;; This file is NOT part of GNU Emacs. The author considers it to be
;; in the public domain.
;;
;; This file is generated from an Org document. That file should be
;; found in the same directory as this in my "dotfiles" repository.

;; I borrow liberally from Protesilaos "Prot" Stavrou's highly
;; instructive literal configuration found on his website:
;;
;; https://protesilaos.com/emacs/dotemacs
;;
;; The clever bits in here are likely from his config. I have changed
;; some names to avoid confusing myself, but I'm not trying to claim
;; his code. Hopefully I've marked these well enough.

;; The `init.el' file is run after `early-init.el'. Here we initialize
;; Emacs 'the application'. Establish package repositories, themes,
;; fonts, visual settings, and load and configure packages.

;;; Code:
