emacs/.config/emacs/literator.org
** Gates and guards.

Many people's configs and most packages check Emacs versions
and attempt to fall back gracefully if the release doesn't include
some feature.

I don't expect to move around to systems that old. Warnings are issued
but the startup is allowed to continue.


#+begin_src emacs-lisp :tangle "new-init.el"

;; Compatibility and requirements.

(when (< emacs-major-version 29)
  (error "This configuration requires Emacs 29 or newer!"))

(when (not (display-graphic-p))
  (message "This Emacs configuration assumes you are running a GUI, some things may break.")
  (sleep-for 5))

#+end_src


** Package archive configuration

This is a pretty standard end user setup for package archives. Emacs
comes with the `gnu' and `nongnu' archives already configured. I add
`melpa' and `melpa-stable' but assign priorities to favor the official
archives first. Any `use-package' can set a `:pin' to a specific
archive.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Packaging and Repositories.

;; We have to `require' use-package if we're being compiled. This is
;; also a good place to set some package load behavior defaults.

(eval-when-compile
  (require 'use-package))
(setopt load-prefer-newer t)
(setopt use-package-always-ensure t)
(setopt package-native-compile t)

;; This is separate from the compile tweaks in `early-init.el' to keep
;; it closer to `use-package' setup.
(setq native-comp-jit-compilation t)

(with-eval-after-load 'package
  (defvar package-archives)
  (add-to-list
   'package-archives
   '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (add-to-list
   'package-archives
   '("melpa" . "https://melpa.org/packages/") t)
  (setopt package-archive-priorities
          '(("gnu" . 10)
            ("nongnu" . 9)
            ("melpa-stable" . 6)
            ("melpa" . 5))))

#+end_src


** Compile Angel

The 'compile-angel' package improves the base native compilation
support by byte and native compiling Emacs Lisp libraries. First time
loading of a new package (or a fresh Emacs install) is a bit slow but
once done, the compiles are generally done.

#+begin_src emacs-lisp :tangle "new-init.el"
;; 'compile-angel' opts for compiling most everything. It's still in
;; early development so this section is likely to change.

;; TODO: gate with native compile available check.
(use-package compile-angel
  :ensure t
  :demand t
  :diminish
  ;;:custom
  ;;  (compile-angel-verbose nil)
  :config
  (diminish 'compile-angel-on-load-mode "")
  (diminish 'compile-angel-on-save-mode "")
  (diminish 'compile-angel-on-save-local-mode "")
  (setq compile-angel-excluded-files-regexps '("/cus-load\\.el$"
                                               "/theme-loaddefs\\.el$"
                                               "/loaddefs\\.el\\.gz$"
                                               "/charprop\\.el$"
                                               "/cl-loaddefs\\.el\\.gz$"
					       "custom.el$"
					       "savehist.el$"
					       "recentf-save.el$"))
  ;; (setq compile-angel-predicate-function
  ;; 	(lambda (file)
  ;;         (not (file-in-directory-p file "/opt/.*"))))

  (compile-angel-on-load-mode)
  (add-hook 'emacs-lisp-mode-hook #'compile-angel-on-save-local-mode))

#+end_src


** If I used a dashboard, it would probably go here

#+begin_src emacs-lisp :tangle "new-init.el"
;; not a dashboard.

(setopt initial-scratch-message ";; nothing to see here, move along")

#+end_src


** Handy macros and functions

Prot wrote a macro to basically comment out some Emacs Lisp code while
leaving it as 'code' in the editor. Pretty cool.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Wrapper macro to "no-op" emacs-lisp code. This is from
;; Prot's configuration.

(defmacro troi-emacs-comment (&rest body)
  "Determine what to do with BODY.
If BODY contains an unquoted plist of the form (:eval t) then
return BODY inside a `progn'.

Otherwise, do nothing with BODY and return nil, with no side
effects."
  (declare (indent defun))
  (let ((eval))
    (dolist (element body)
      (when-let* (((plistp element))
                  (key (car element))
                  ((eq key :eval))
                  (val (cadr element)))
        (setq eval val
              body (delq element body))))
    (when eval `(progn ,@body))))

#+end_src


** Reduce Emacs directory clutter

The `no-littering' package attempts to reduce the clutter of
`user-emacs-directory' by coercing various packages to use
sub-directories `etc/' and `var/'. This needs to come as early as
possible in =init.el= and so I put it closely after `package' and
`use-package' are established.

There is a full migration guide (that I have not read yet) at
<https://github.com/emacscollective/no-littering/> but just adding
this and deleting some stragglers I don't care about has been helpful.

#+begin_src emacs-lisp :tangle "new-init.el"
;; No littering to reduce directory clutter.

;; NOTE: Yes, the two `require' calls in that order are deliberate and
;; they seem to work. Without them, not so much.

(use-package no-littering
  :ensure t
  :init
  (require 'no-littering)
  (require 'recentf)
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory))

(use-package recentf
  :ensure nil
  :custom
  (recentf-max-menu-items 100)
  (recentf-max-saved-items 100)
  :config
  (recentf-mode))

#+end_src


** Get environment variables

Getting shell environment variables on MacOS builds is not reliable.
The packaging into a MacOS app requires that the desired variables are
listed in a configuration plist.

Unfortunately that hasn't been working consistently. Even when it does
work, the variables are hard coded and not comprehensive.

The `exec-path-from-shell' package lets me specify the variables I
require.

TODO: Consider a separate configuration file for a variable list.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Environment variables.

;; Get the correct environment variable values as if this is a login
;; shell. The variable list is hard coded and specific to my needs.

(use-package exec-path-from-shell
  :config
  (declare-function
   exec-path-from-shell-initialize "exec-path-from-shell" ())
  (declare-function
   exec-path-from-shell-copy-envs "exec-path-from-shell")
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-envs
   '(
     ;; Old style Makefile variables for C. I probably don't need
     ;; these anymore.
     "LIBRARY_PATH"
     "CPATH"
     "CDPATH"

     ;; Environment variables specific to compile and build for any
     ;; languages I'm working with.
     "CMAKE_GENERATOR"
     "ODIN_ROOT"

     ;; Where is the documentation? I know MANPATH is not used on all
     ;; operating systems, but it doesn't cause me problems to get it.
     "INFOPATH"
     "MANPATH"

     ;; Apple's libc malloc library emits some informational warnings
     ;; specific to particular allocation pools. They do me know good.
     "MallocNanoZone"
     )))

#+end_src


** Turn off backups, lock-files, and auto-save

In the 21st Century computers and file systems are very reliable. And
then there's the /Cloud/. Lock-files don't make sense for me since I'm
always on a single user system.

#+begin_src emacs-lisp :tangle "new-init.el"
;; No safety net needed.

(setopt make-backup-files nil)
(setopt backup-inhibited nil) ; Is this redundant?
(setopt create-lockfiles nil)
(setopt auto-save-default nil)

#+end_src


** Directories and files

Most directory assignment will be done with their related package
setup. I've got `load-path' and some Org handled here directories in
an attempt to keep new directory creation in one place.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Directories and files.

;; Add to the `load-path'. So far this is just my scratch
;; lisp directory.

(add-to-list
 'load-path
 (concat user-emacs-directory "troi-lisp"))

;; Org mode files and directories.

(setq org-dir (substitute-in-file-name "$HOME/org"))
(if (not (file-directory-p org-dir))
    (make-directory org-dir))
(setq org-directory org-dir)
(setq org-agenda-files '(org-directory))

(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))

#+end_src


** Dired

This is as good a place as any to configure `dired'. On the Mac I have
to force it to use the GNU `ls' as the built-in one does not support
some options that `dired' needs.

TODO: This is complete but it could be improved. Do I want the extras?

#+begin_src emacs-lisp :tangle "new-init.el"
;; for dired, use 'gls' if it's available. the default 'ls' in MacOS
;; and some other systems doesn't support all the options that 'dired'
;; wants.

(use-package dired
  :after exec-path-from-shell
  :ensure nil
  :commands (dired)
  :config
  (setopt
   dired-recursive-copies  'always
   dired-isearch-filenames 'dwim)
  (when (executable-find "gls")    ; use GNU ls
    (setopt dired-use-ls-dired nil)
    (setopt ls-lisp-use-insert-directory-program t)
    (setopt insert-directory-program "gls")
    (setopt dired-listing-switches "-alh --group-directories-first"))
  (setopt dired-recursive-copies 'always)
  (setopt dired-recursive-deletes 'always)
  (setopt dired-kill-when-opening-new-dired-buffer t)
  (setopt delete-by-moving-to-trash t)
  (setopt dired-dwim-target t)
  (setopt dired-auto-revert-buffer t)
  (setopt dired-do-revert-buffer t)
  (setopt dired-free-space 'separate))

(use-package wdired
  :ensure nil
  :commands (wdired-change-to-wdired-mode)
  :config
  (setq wdired-allow-to-change-permissions t)
  (setq wdired-create-parent-directories t))

#+end_src


