emacs/.config/emacs/new-init.el

;; Compatibility and requirements.

(when (< emacs-major-version 29)
  (error "This configuration requires Emacs 29 or newer!"))

(when (not (display-graphic-p))
  (message "This Emacs configuration assumes you are running a GUI, some things may break.")
  (sleep-for 5))

;; Packaging and Repositories.

;; We have to `require' use-package if we're being compiled. This is
;; also a good place to set some package load behavior defaults.

(eval-when-compile
  (require 'use-package))
(setopt load-prefer-newer t)
(setopt use-package-always-ensure t)
(setopt package-native-compile t)

;; This is separate from the compile tweaks in `early-init.el' to keep
;; it closer to `use-package' setup.
(setq native-comp-jit-compilation t)

(with-eval-after-load 'package
  (defvar package-archives)
  (add-to-list
   'package-archives
   '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (add-to-list
   'package-archives
   '("melpa" . "https://melpa.org/packages/") t)
  (setopt package-archive-priorities
          '(("gnu" . 10)
            ("nongnu" . 9)
            ("melpa-stable" . 6)
            ("melpa" . 5))))

;; 'compile-angel' opts for compiling most everything. It's still in
;; early development so this section is likely to change.

;; TODO: gate with native compile available check.
(use-package compile-angel
  :ensure t
  :demand t
  :diminish
  ;;:custom
  ;;  (compile-angel-verbose nil)
  :config
  (diminish 'compile-angel-on-load-mode "")
  (diminish 'compile-angel-on-save-mode "")
  (diminish 'compile-angel-on-save-local-mode "")
  (setq compile-angel-excluded-files-regexps '("/cus-load\\.el$"
                                               "/theme-loaddefs\\.el$"
                                               "/loaddefs\\.el\\.gz$"
                                               "/charprop\\.el$"
                                               "/cl-loaddefs\\.el\\.gz$"
					       "custom.el$"
					       "savehist.el$"
					       "recentf-save.el$"))
  ;; (setq compile-angel-predicate-function
  ;; 	(lambda (file)
  ;;         (not (file-in-directory-p file "/opt/.*"))))

  (compile-angel-on-load-mode)
  (add-hook 'emacs-lisp-mode-hook #'compile-angel-on-save-local-mode))

;; not a dashboard.

(setopt initial-scratch-message ";; nothing to see here, move along")

;; Wrapper macro to "no-op" emacs-lisp code. This is from
;; Prot's configuration.

(defmacro troi-emacs-comment (&rest body)
  "Determine what to do with BODY.
If BODY contains an unquoted plist of the form (:eval t) then
return BODY inside a `progn'.

Otherwise, do nothing with BODY and return nil, with no side
effects."
  (declare (indent defun))
  (let ((eval))
    (dolist (element body)
      (when-let* (((plistp element))
                  (key (car element))
                  ((eq key :eval))
                  (val (cadr element)))
        (setq eval val
              body (delq element body))))
    (when eval `(progn ,@body))))

;; No littering to reduce directory clutter.

;; NOTE: Yes, the two `require' calls in that order are deliberate and
;; they seem to work. Without them, not so much.

(use-package no-littering
  :ensure t
  :init
  (require 'no-littering)
  (require 'recentf)
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory))

(use-package recentf
  :ensure nil
  :custom
  (recentf-max-menu-items 100)
  (recentf-max-saved-items 100)
  :config
  (recentf-mode))

;; Environment variables.

;; Get the correct environment variable values as if this is a login
;; shell. The variable list is hard coded and specific to my needs.

(use-package exec-path-from-shell
  :config
  (declare-function
   exec-path-from-shell-initialize "exec-path-from-shell" ())
  (declare-function
   exec-path-from-shell-copy-envs "exec-path-from-shell")
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-envs
   '(
     ;; Old style Makefile variables for C. I probably don't need
     ;; these anymore.
     "LIBRARY_PATH"
     "CPATH"
     "CDPATH"

     ;; Environment variables specific to compile and build for any
     ;; languages I'm working with.
     "CMAKE_GENERATOR"
     "ODIN_ROOT"

     ;; Where is the documentation? I know MANPATH is not used on all
     ;; operating systems, but it doesn't cause me problems to get it.
     "INFOPATH"
     "MANPATH"

     ;; Apple's libc malloc library emits some informational warnings
     ;; specific to particular allocation pools. They do me know good.
     "MallocNanoZone"
     )))

;; No safety net needed.

(setopt make-backup-files nil)
(setopt backup-inhibited nil) ; Is this redundant?
(setopt create-lockfiles nil)
(setopt auto-save-default nil)

;; Directories and files.

;; Add to the `load-path'. So far this is just my scratch
;; lisp directory.

(add-to-list
 'load-path
 (concat user-emacs-directory "troi-lisp"))

;; Org mode files and directories.

(setq org-dir (substitute-in-file-name "$HOME/org"))
(if (not (file-directory-p org-dir))
    (make-directory org-dir))
(setq org-directory org-dir)
(setq org-agenda-files '(org-directory))

(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))

;; for dired, use 'gls' if it's available. the default 'ls' in MacOS
;; and some other systems doesn't support all the options that 'dired'
;; wants.

(use-package dired
  :after exec-path-from-shell
  :ensure nil
  :commands (dired)
  :config
  (setopt
   dired-recursive-copies  'always
   dired-isearch-filenames 'dwim)
  (when (executable-find "gls")    ; use GNU ls
    (setopt dired-use-ls-dired nil)
    (setopt ls-lisp-use-insert-directory-program t)
    (setopt insert-directory-program "gls")
    (setopt dired-listing-switches "-alh --group-directories-first"))
  (setopt dired-recursive-copies 'always)
  (setopt dired-recursive-deletes 'always)
  (setopt dired-kill-when-opening-new-dired-buffer t)
  (setopt delete-by-moving-to-trash t)
  (setopt dired-dwim-target t)
  (setopt dired-auto-revert-buffer t)
  (setopt dired-do-revert-buffer t)
  (setopt dired-free-space 'separate))

(use-package wdired
  :ensure nil
  :commands (wdired-change-to-wdired-mode)
  :config
  (setq wdired-allow-to-change-permissions t)
  (setq wdired-create-parent-directories t))
