emacs/.config/emacs/new-init.el

;; History and such.

(use-package savehist
  :ensure nil
  :config
  (setopt savehist-additional-variables
          '(compile-command
            kill-ring
            regexp-search-ring))
  (savehist-mode)
  (setq history-length 100)
  (setq history-delete-duplicates t)
  (setq savehist-save-minibuffer-history t))

(use-package saveplace
  :ensure nil
  :config
  (save-place-mode)
  :custom
  (save-place-limit 1000))

(use-package autorevert
  :ensure nil
  :config
  (global-auto-revert-mode +1)
  :custom
  (auto-revert-avoid-polling t)
  (global-auto-revert-non-file-buffers t)
  (auto-revert-verbose t))

;; Tool-tips (tooltip-mode)

(use-package tooltip
  :ensure nil
  :hook (after-init . tooltip-mode)
  :config
  (setq tooltip-delay 0.5
        tooltip-short-delay 0.5
        tooltip-frame-parameters
        '((name . "tooltip")
          (internal-border-width . 10)
          (border-width . 0)
          (no-special-glyphs . t))))

;; Set up column numbers and row/column tracking in the
;; mode line.

(setopt apropos-sort-by-scores t)
(setopt blink-matching-delay 0.1)

;; Line numbering in programming modes is the way. Later I set the
;; mode-line format so the format starts counting columns at 1.

(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(setopt display-line-numbers-width 4)

;; Highlight the cursor line.

(setq global-hl-line-sticky-flag t)
(global-hl-line-mode)

;; Diminish mode indicators.

(use-package diminish
  :ensure t)

;; I run with column information visible full time. And I count from
;; one the way God intended.

(column-number-mode)
(setopt mode-line-position-column-line-format '(" (%l,%C)")) ; %C based 1, %c based 0

;; Display function name in mode line.

(which-function-mode)

;; Highlight the cursor line.

(global-hl-line-mode)

;; I use this rarely.

(use-package hide-mode-line
  :ensure t
  :defer t
  :bind
  ("C-c C-h" . hide-mode-line-mode))

;; Theme and some font/face.

(setopt custom-safe-themes t)
(use-package acme-theme
  :ensure t
  :config
  (mapc #'disable-theme custom-enabled-themes)
  (load-theme 'acme t)
  (setopt acme-theme-black-fg t)
  (custom-set-faces
   '(hl-line ((t (
                  :inherit highlight
                  :extend t
                  :background "LightGoldenrod2"
                  :foreground "black"))))
   '(compilation-error ((t (:background "gray80" :foreground "Red"))))
   '(flymake-error ((t (:underline (:color "Red" :style wave :position nil)))))
   '(font-lock-comment-face ((t (:foreground "#707070" :slant oblique))))
   '(font-lock-comment-face ((t (:foreground "#005500" :slant oblique))))))

;; Pulling out of custom.el to control here.

(set-face-attribute 'default nil :font "FiraCode Nerd Font Mono" :height 190)
(set-face-attribute 'fixed-pitch nil :font "FiraCode Nerd Font Mono" :height 190)
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 230 :weight 'medium)
;; Choose some fonts
;; (set-face-attribute 'default nil :family "Iosevka")
;; (set-face-attribute 'variable-pitch nil :family "Iosevka Aile")

;; This is a straight copy and paste from Prot's config. Someday I'll
;; tune these to my preferences.

(setq light-mode nil)
(if light-mode
    (setq
     ;; TODO States
     todo-color "DarkOrange"
     in-progress-color "DeepSkyBlue3"
     blocked-color "Firebrick1"
     done-color "Green3"
     wont-do-color "Green3"
     ;; Tags
     critical-color "red1"
     easy-color "turquoise4"
     medium-color "turquoise4"
     hard-color "turquoise4"
     work-color "royalblue1"
     home-color "mediumPurple2"
     )
  (setq
   ;; TODO States
   todo-color "GoldenRod"
   in-progress-color "Cyan"
   blocked-color "Red"
   done-color "LimeGreen"
   wont-do-color "LimeGreen"
   ;; Tags
   critical-color "red1"
   easy-color "cyan3"
   medium-color "cyan3"
   hard-color "cyan3"
   work-color "royalblue1"
   home-color "mediumPurple1"
   )
  )

;; Icons

;; The Nerd Icons. Not that these depend upon having the Nerd Fonts on
;; your system.

(use-package nerd-icons
  :ensure t)

(use-package nerd-icons-dired
  :ensure t
  :after (dired nerd-icons)
  :diminish
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package nerd-icons-completion
  :after (corfu vertico marginalia nerd-icons)
  :diminish
  :config
  (declare-function nerd-icons-completion-mode "nerd-icons-completion")
  (nerd-icons-completion-mode)
  (declare-function nerd-icons-completion-marginalia-setup "nerd-icons-completion")
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package nerd-icons-ibuffer
  :after (nerd-icons ibuffer)
  :diminish
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

(use-package nerd-icons-corfu
  :after (nerd-icons corfu))

;; Add kind of item icons to marginalia notes (folder, file, etc).

(use-package kind-icon
  :ensure t
  :after (corfu marginalia vertico)
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

;; add descriptive notes 'in the margin' of various lists/uis.

(use-package marginalia
  :config
  (marginalia-mode))
