emacs/.config/emacs/new-init.el

;; Is there such a thing as a basic or minimal Org configuration?

(use-package org
  :ensure t
  :pin gnu
  :custom
  (org-confirm-babel-evaluate nil)
  (org-src-fontify-natively t)
  (org-src-tab-acts-natively t)
  (org-src-preserve-indentation t)
  :config
  (setq org-return-follows-link nil)
  (setq org-loop-over-headlines-in-active-region 'start-level)
  (setq org-modules '(ol-info))
  (setq org-use-sub-superscripts '{})
  (setq org-highlight-latex-and-related nil)
  (setq org-fontify-quote-and-verse-blocks t)
  (setq org-fontify-whole-block-delimiter-line t)
  (setq org-highest-priority ?A)
  (setq org-lowest-priority ?C)
  (setq org-default-priority ?B)
  (setq org-priority-faces nil)
  ;; TODO: is there a better way to do this?
  ;; TODO: move what can be moved into :custom.
  (setq org-log-done 'time)
  (setq org-todo-keywords
  	'((sequence "TODO(t)" "DOING(i@/!)" "BLOCKED(b@/!)"
  		    "|"
  		    "DONE(d@/!)" "WONT-DO(w@/!)" )))
  (setq org-capture-templates
  	'(
          ("t" "TODO Item"
           entry (file "~/org/todos.org")
           "* TODO [#B] %? %^g\n"
           :empty-lines 0)

          ("j" "Journal Entry"
           entry (file+datetree "~/org/journal.org")
           "* %?"
           :empty-lines 1)

          ("n" "Note"
           entry (file+headline "~/org/notes.org" "Random Notes")
           "** %?"
           :empty-lines 0)
          ))
  (setq org-tag-alist
  	'(
          (:startgroup . nil)
          ("easy" . ?e)
          ("medium" . ?m)
          ("difficult" . ?d)
          (:endgroup . nil)

          (:startgroup . nil)
          ("@work" . ?w)
          ("@home" . ?h)
          ("@anywhere" . ?a)
          (:endgroup . nil)

          ("CRITICAL" . ?c)
          ))
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-todo-keyword-faces
  	`(
          ("TODO"        . (:weight bold :foreground ,todo-color        ))
          ("IN-PROGRESS" . (:weight bold :foreground ,in-progress-color ))
          ("BLOCKED"     . (:weight bold :foreground ,blocked-color     ))
          ("DONE"        . (:weight bold :foreground ,done-color        ))
          ("WONT-DO"     . (:weight bold :foreground ,wont-do-color     ))
          )
  	)
  (setq org-tag-faces
  	`(
          ("CRITICAL" . (:weight bold :foreground ,critical-color ))
          ("easy"     . (:weight bold :foreground ,easy-color     ))
          ("medium"   . (:weight bold :foreground ,medium-color   ))
          ("hard"     . (:weight bold :foreground ,hard-color     ))
          ("@work"    . (:weight bold :foreground ,work-color     ))
          ("@home"    . (:weight bold :foreground ,home-color     ))
          )
  	)
  )

;; TODO: set up for my use...
;; (setq org-structure-template-alist
;; 	        '(
;; 	  ("C" . "comment")
;; 	  ("q" . "quote")
;; 	  ("c" . "center")
;; 	  ("v" . "verse")
;;          ("x" . "example")
;;
;; 	  ("a" . "export ASCII")
;;          ("X" . "export")
;;
;; 	  ("s" . "src")
;;          ("e" . "src emacs-lisp")
;;
;;          ("t" . "src emacs-lisp :tangle FILENAME")
;;          ("E" . "src emacs-lisp :results value code :lexical t")
;;          ("T" . "src emacs-lisp :tangle FILENAME :mkdirp yes")
;; 	  ))

;; Load `org-modern' and `org-bullets' but do not enable them here. I
;; find outline editing easier without these turned on but there may
;; come a time when have them on all the time.

(use-package org-modern
  :ensure t
  :defer t)

(use-package org-bullets
  :ensure t
  :defer t)

;; Specialized support for the odd language or whatever else comes up.

(use-package ob-sml
  :ensure t)

(use-package ob-typescript
  :ensure t)

;; Org related key-binds.

(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(define-key global-map "\C-cc" 'org-capture)

;; Dictionary.

(use-package dictionary
  :ensure nil
  ;;    :bind ("C-c d" . dictionary-search)
  :config
  (setq dictionary-server "dict.org"
        dictionary-default-popup-strategy "lev"
        dictionary-create-buttons nil
        dictionary-use-single-buffer t))

;; Spell check with flyspell.

(use-package flyspell
  :ensure nil
  ;;     :bind
  ;;     ( :map flyspell-mode-map
  ;;       ("C-;" . nil)
  ;;       :map flyspell-mouse-map
  ;;       ("<mouse-3>" . flyspell-correct-word)
  ;;       :map ctl-x-x-map
  ;;       ("s" . flyspell-mode)) ; C-x x s
  :config
  (setq flyspell-issue-message-flag nil)
  (setq flyspell-issue-welcome-flag nil)
  (setq ispell-program-name "aspell")
  (setq ispell-dictionary "en_US"))

;; 'deft' is a light weight free format note application.

(use-package deft
  :config
  (setopt deft-directory
  	  (expand-file-name "~/Notepad"))
  (setopt deft-text-mode (seq-find 'fboundp '(markdown-mode text-mode)))
  (setopt deft-extension
          (assoc-default deft-text-mode '((markdown-mode . "md") (rst-mode . "rst"))
  			 'eq "txt")))

;; I use side-notes as scratch paper in project directories. The notes
;; files aren't stored in Git, I have them excluded in my .gitignore.

(use-package side-notes
  :diminish
  :bind ("M-s n" . side-notes-toggle-notes)
  :custom
  (side-notes-file "side-notes.txt")
  (side-notes-secondary-file "~/general-side-notes.txt"))

;; documentation with 'info' and 'eldoc'. for some reason I'm missing
;; system info from Homebrew. i should probably move this into my
;; zshenv.

(use-package info
  :after exec-path-from-shell
  :custom
  (Info-additional-directory-list '("/opt/homebrew/share/info")))

(use-package eldoc
  :ensure nil
  :diminish
  :config (global-eldoc-mode))

;; `man' (man-pages)

(use-package man
  :ensure nil
  :commands (man)
  :config
  (setq Man-notify-method 'pushy)) ; does not obey `display-buffer-alist'

;; Improve processing of excessively long lines. Forcing left-to-right
;; instead of allowing for right-to-left is apparently a significant
;; improvement for long lines.

(use-package so-long
  :config
  (global-so-long-mode)
  :custom
  (bidi-paragraph-direction 'left-to-right))

;; Treemacs seems useful.

(use-package treemacs
  :ensure t
  :after nerd-icons
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t t"   . treemacs)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))

(use-package treemacs-nerd-icons
  :after treemacs
  :ensure t)
