emacs/.config/emacs/literator.org
** Completion and mini-buffer

The mini-buffer does most of the heavy lifting of user interaction.
There are a myriad of packages for presentation, formatting, styles of
completion (what is offered, and in what order).

It can all be very confusing.

But after you've used Emacs with a tricked out mini-buffer, going back
to using just built-in support is a no-go.

These are all part of the built-in completion framework that `corfu'
and others build upon.

#+begin_src emacs-lisp :tangle "new-init.el"
;; completion styles

(use-package minibuffer
  :ensure nil
  :config

   ; Also see `completion-category-overrides'.
  (setq completion-styles '(basic substring initials flex prescient))

  ;; Reset all the per-category defaults so that (i) we use the
  ;; standard `completion-styles' and (ii) can specify our own styles
  ;; in the `completion-category-overrides' without having to
  ;; explicitly override everything.
  (setq completion-category-defaults nil)

  ;; A non-exhaustive list of known completion categories:
  ;;
  ;; - `bookmark'
  ;; - `buffer'
  ;; - `charset'
  ;; - `coding-system'
  ;; - `color'
  ;; - `command' (e.g. `M-x')
  ;; - `customize-group'
  ;; - `environment-variable'
  ;; - `expression'
  ;; - `face'
  ;; - `file'
  ;; - `function' (the `describe-function' command bound to `C-h f')
  ;; - `info-menu'
  ;; - `imenu'
  ;; - `input-method'
  ;; - `kill-ring'
  ;; - `library'
  ;; - `minor-mode'
  ;; - `multi-category'
  ;; - `package'
  ;; - `project-file'
  ;; - `symbol' (the `describe-symbol' command bound to `C-h o')
  ;; - `theme'
  ;; - `unicode-name' (the `insert-char' command bound to `C-x 8 RET')
  ;; - `variable' (the `describe-variable' command bound to `C-h v')
  ;; - `consult-grep'
  ;; - `consult-isearch'
  ;; - `consult-kmacro'
  ;; - `consult-location'
  ;; - `embark-keybinding'

  (setq completion-category-overrides
        '((file (styles . (basic partial-completion prescient)))
          (bookmark (styles . (basic substring)))
          (library (styles . (basic substring)))
          (embark-keybinding (styles . (basic substring)))
          (imenu (styles . (basic substring prescient)))
          (consult-location (styles . (basic substring prescient)))
          (kill-ring (styles . (emacs22 prescient)))
          (eglot (styles . (emacs22 substring prescient))))))

;; Built-in completion dials and switches.

;; TODO: ordering with use package above.
(setq completion-ignore-case t)
(setq read-buffer-completion-ignore-case t)
;; (setq-default case-fold-search t)   ; For general regexp
(setq read-file-name-completion-ignore-case t)

(setopt completion-cycle-threshold 1)
(setopt completions-detailed t)
(setopt completion-auto-help 'always)
(setopt completions-max-height 7)
(setopt completions-format 'one-column)
(setopt completions-group t)
(setopt completion-auto-select 'second-tab)

(use-package mb-depth
  :ensure nil
  :hook (after-init . minibuffer-depth-indicate-mode))

(use-package minibuf-eldef
  :ensure nil
  :hook (after-init . minibuffer-electric-default-mode)
  :config
  (setq minibuffer-default-prompt-format " [%s]")) ; Emacs 29

#+end_src


** Corfu

'Corfu' provides COmpletion in Region FUnctions and popups support.

#+begin_src emacs-lisp :tangle "new-init.el"
;; COmpletion in Region FUnctions:

;; Corfu offers popup support both terminal and GUI use, but I do not
;; use the terminal.

(use-package corfu
  :ensure t
  :commands
  (corfu-mode global-corfu-mode)
  :bind
  (:map corfu-map
        ("SPC" . corfu-insert-separator)
        ("C-n" . corfu-next)
        ("C-p" . corfu-previous))
  :hook ((prog-mode . corfu-mode)
         (shell-mode . corfu-mode)
         (eshell-mode . corfu-mode))
  :custom
  ;; This hides commands in m-x which do not apply to the current mode.
  (read-extended-command-predicate #'command-completion-default-include-p)
  :config
  (global-corfu-mode))

(use-package corfu-popupinfo
  :after corfu
  :ensure nil          ; This is part of the corfu package.
  :hook (corfu-mode . corfu-popupinfo-mode)
  :custom
  (corfu-popupinfo-delay '(0.25 . 0.1))
  (corfu-popupinfo-hide nil)
  :config
  (corfu-popupinfo-mode))

;; Completion At Point Extensions:

(use-package cape
  :ensure t
  :init
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file))

#+end_src


** Vertico

Vertical interactive completion. There are man options for completion
presentation. This is the one I see most frequently in current
configurations and it seems lighter weight than others.

I don't use it well, but it works for me.

#+begin_src emacs-lisp :tangle "new-init.el"
;; VERtical Interactive COmpletion.

(use-package vertico
  :ensure t
  :init
  (vertico-mode))

(use-package vertico-directory
  :after vertico
  :ensure nil
  :bind (:map vertico-map
              ("M-DEL" . vertico-directory-delete-word)))

#+end_src


** Prescient

The currently /en vogue/ completion candidate selection and sorting
packages are Orderless and Prescient. I've been happy with both but
Prescient strives to require the minimum of configuration. It
succeeds.

Prot's base configuration does a lot of interesting things with
Orderless and I need to review those, but for now ... Prescient.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Prescient completion candidate sorting and selection.

(use-package prescient
  :ensure t
  :config
  (prescient-persist-mode))

(use-package corfu-prescient
  :ensure t
  :after (prescient corfu)
  :config
  (corfu-prescient-mode))

(use-package vertico-prescient-mode
  :ensure nil
  :after (prescient vertico)
  (vertico-prescient-mode))

#+end_src


** Key binds

Grouping keybindings with their associated 'use-package' or 'require'
makes a lot of sense, but then again so does having them all in one
place. I'm putting global bindings here and will investigate pulling
others here as well. `use-package' allows multiple `use-package'
blocks for a package, so the bind sections could be moved here.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Key binds

;; This makes TAB in the minibuffer behave more like it does in a
;; shell.
(keymap-set minibuffer-mode-map "TAB" 'minibuffer-complete)

;; Make ESC quit prompts.
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; On the Mac s-q is the command-Q equivalent. I use it to close Emacs
;; when I don't use M-x 'save-buffers-kill-emacs'.
(global-unset-key (kbd "C-x C-c"))

;; The number of times I want a dumb list instead of the smart UI for
;; buffers and directories is zero.
(global-set-key (kbd "C-x C-d") 'dired)
(global-set-key (kbd "C-x C-b") 'ibuffer)

;; Default search to regexp instead of string. TODO: Provide a toggle
;; or string option.
(global-set-key (kbd "C-s") 'isearch-forward-regexp)
(global-set-key (kbd "C-r") 'isearch-backward-regexp)

;; Zap 'to' not 'through'. This is the way.
(global-set-key "\M-z" 'zap-up-to-char)

;; TODO: are these the bindings I want for these?
;;("M-c" . capitalize-dwim)
;;("M-l" . downcase-dwim) ; "lower" case
;;("M-u" . upcase-dwim)
;;("M-=" . count-words) ;; was count-words-region

;; ("C-M-d" . up-list) ; confusing name for what looks like "down" to me
;; ("<C-M-backspace>" . backward-kill-sexp)
;; Keymap for buffers (Emacs28)
;; :map ctl-x-x-map
;; ("f" . follow-mode)  ; override `font-lock-update'
;; ("r" . rename-uniquely)
;; ("l" . visual-line-mode)

#+end_src


** Bookmarks and Registers

Bookmarks and registers are closely related and use much the same
interface as registers.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Built-in bookmarking framework.

(use-package bookmark
  :ensure nil
  :commands (bookmark-set bookmark-jump bookmark-bmenu-list)
  :hook (bookmark-bmenu-mode . hl-line-mode)
  :config
  (setq bookmark-save-flag 1))          ; persist bookmark updates

;; Registers, named holders.

(use-package register
  :ensure nil
  :defer t
  :config
  (setq register-preview-delay 0.8
        register-preview-function #'register-preview-default)

  (with-eval-after-load 'savehist
    (add-to-list 'savehist-additional-variables 'register-alist)))

#+end_src


** Movement and navigation

Most of the time I still use the arrow keys but I am trying to use
smarter movement commands. Here are some packages that help.

TODO: move to key-bind section.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Movement and navigation.

(use-package avy
  :demand t
  :bind (("C-c j" . avy-goto-line)
         ("s-j"   . avy-goto-char-timer)))

(use-package ace-window
  :demand t
  :after avy
  :bind (("C-x o" . ace-window)
  	 ("M-o" . ace-window)))

(use-package dumb-jump
  :hook
  (xref-backend-functions . dump-jump-xref-activate))

#+end_src


