emacs/.config/emacs/literator.org
** Eglot

Eglot is the Emacs built-in support for the Language Server Protocol
(LSP). It strives for minimal configuration and succeeds, but there is
some assumed knowledge that I didn't have that caused some head
banging at times.

Here is the main configuration of Eglot, independent of language mode.
Wiring a language mode to use Eglot is done in each language mode
section. If a language server is available the server is added to
Eglot's server mappings.

In a language mode buffer that can use Eglot/LSP, M-x eglot or
M-x eglot-ensure will start Eglot for that buffer's project.

Do not add eglot-ensure to all programming modes. The behavior is
unpredictable if there is no LSP support installed for some modes, and
others do not even have a language server.

While Eglot is built-in, it gets relatively frequent updates. Like
Org, make sure to have the latest from the GNU package archive.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Eglot

(use-package eglot
  :ensure t
  :pin gnu

  ;; We can start up language servers as sub-processes, be sure we can
  ;; find the executables.
  :after exec-path-from-shell

  :commands (eglot
  	     eglot-ensure
  	     eglot-code-actions
             eglot-rename
             eglot-format-buffer)

  :hook
  (c-ts-mode . eglot-ensure)
  (c++-ts-mode . eglot-ensure)
  (odin-mode . eglot-ensure)

  :bind (:map eglot-mode-map
              ("C-c c a" . eglot-code-actions)
              ("C-c c r" . eglot-rename))

  ;; if debugging 'eglot' issues, comment out the fset and
  ;; events-buffer-config lines.
  :config
  (fset #'jsonrpc--log-event #'ignore)  ; performance boost-don't log every event
  (setopt jsonrpc-event-hook nil)

  :custom
  (eglot-events-buffer-config '(:size 0 :format short))
  (eglot-autoshutdown t)
  (eglot-send-changes-idle-time 0.1)
  (eglot-extend-to-xref t)
  (eglot-report-progress nil)  ; Prevent minibuffer spam
  (eglot-ignored-server-capabilities
   '(:documentFormattingProvider
     :documentRangeFormattingProvider
     :documentOnTypeFormattingProvider)))

#+end_src


** Treesitter

There are packages and/or built-in modes for every language I care
about other than mainframe assembly, mainframe JCL, and ARM assembly.
The old style modes use regexp based parsing which can be slow, error
prone, and "touchy". They frequently rely on tag files for code
navigation.

Treesitter is the "next new thing". It's a smarter parser system that
uses precompiled grammar definitions to work with language mode
packages that use it instead of relying on regexp based parsing.

I use the "ts" modes when I can.

NOTE: The Emacs and Treesitter development groups are independent and
      aren't in sync and sometimes a new release of Emacs or
      Treesitter will not match the ABI of the other. Be prepared to
      pin the Treesitter release to match Emacs as Emacs is going to
      lag behind Treesitter updates.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Treesitter

;; There isn't much configuration to do for Treesitter. The
;; customization options are minimal and it's just "always there."

(use-package treesit
  :ensure nil
  :custom
  (treesit-font-lock-level 4)) ; levels 1-3 are useless

;; some of these might require M-x treesit-install-language-grammar

(setopt major-mode-remap-alist
        '((yaml-mode . yaml-ts-mode)
          (bash-mode . bash-ts-mode)
          (js-mode . js-ts-mode)
          (typescript-mode . typescript-ts-mode)
          (json-mode . json-ts-mode)
  	  (c-mode . c-ts-mode)
  	  (c++-mode . c++-ts-mode)
  	  (c-or-c++-mode . c-or-c++-ts-mode)
  	  (ruby-mode . ruby-ts-mode)))

(use-package treesit-auto
  :ensure t
  :after exec-path-from-shell
  :custom
  (treesit-auto-install 'prompt)
  :config
  (declare-function treeset-auto-add-to-auto-mode-alist "treesit-auto" t t)
  (treesit-auto-add-to-auto-mode-alist
   '(bash
     c
     commonlisp
     cpp
     go
     html
     java
     javascript
     json
     make
     markdown
     org
     python
     ruby
     toml
     typescript
     yaml))
  (declare-function global-treesit-auto-mode "treesit-auto")
  (global-treesit-auto-mode))

#+end_src


** Frame borders and dividers

Add frame borders and window dividers to give a bit of clear space
between UI elements and the edge of the physical screen.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Add frame borders and window dividers to give me a bit of
;; separation from the edge of the screen.

(modify-all-frames-parameters
 '((right-divider-width . 5)
   (internal-border-width . 5)))
(dolist (face '(window-divider
                window-divider-first-pixel
                window-divider-last-pixel))
  (face-spec-reset-face face)
  (set-face-foreground face (face-attribute 'default :background)))
(set-face-background 'fringe (face-attribute 'default :background))

#+end_src


** "Tear off" a window and move it to a new frame

I usually run with only one maximized frame with two windows at most.
But there are times when multiple frames are warranted. This function
takes a window from a multi-window frame and puts it in a new frame.

This only works if there are multiple windows in the current frame.

The original function is from https://stackoverflow.com/a/57318988
_How to move a buffer to a new frame_.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Utility function to move a window to a new frame.

(defun troi/tear-off-window ()
  "Move a sub-window to a new frame.
From a multi-window frame, tear off the current window and put
it in a new frame."
  (interactive)
  (let ((wc (count-windows)))
    (if (< wc 2)
  	(message "only one window")
      (let* ((window (selected-window))
  	     (buf (window-buffer window))
  	     (frame (make-frame)))
  	(select-frame frame)
  	(switch-to-buffer buf)
  	(delete-window window)))))

;; TODO: move key-binds
(bind-key "C-x 5t" #'troi/tear-off-window)

#+end_src


** Flymake

Flymake is a built-in linting and error reporting system. Eglot
prefers Flymake. As with Treesit and Eglot, there isn't much
configuration needed to be usable.

#+begin_src emacs-lisp :tangle "new-init.el"
;; Flymake

;; 'flymake' has been a good linter interface. 'eglot' reports issues
;; from 'clang-tidy' through 'flymake'.

(use-package flymake
  :after (exec-path-from-shell odin-mode)

  :hook
  (c-ts-mode . flymake-mode)
  (c++-ts-mode . flymake-mode)
  (emacs-lisp-mode . flymake-mode)
  (odin-mode . flymake-mode)

  :custom
  (flymake-mode-line-lighter "FM")
  :bind
  (:map flymake-mode-map
  	("M-n" . flymake-goto-next-error)
  	("M-p" . flymake-goto-prev-error)
        ("C-c ! l" . flymake-show-buffer-diagnostics)
        ("C-c ! L" . flymake-show-project-diagnostics)))

;; This is needed to avoid false 'can not find/load' errors on
;; requires that occur before this point in the source.
(with-eval-after-load 'flymake
  (setopt elisp-flymake-byte-compile-load-path load-path))

#+end_src


** Project

I don't adequately use 'project', and 'projectile' would be wasted on
me.
That said, the idea of a directory and its children being a project
group makes sense.

'project' uses source control artifacts to identify projects, but I
don't always use source control for small projects. Adding other
possible markers is easy. 'fpm.toml' is the Fortran Project Manager.

#+begin_src emacs-lisp :tangle "new-init.el"
;; `project'

(use-package project
  :ensure nil
  :config
  (setopt project-switch-commands
          '((project-find-file "Find file")
            (project-find-regexp "Find regexp")
            (project-find-dir "Find directory")
            (project-dired "Root dired")
            (project-vc-dir "VC-Dir")
            (project-shell "Shell")
            (keyboard-quit "Quit")))
  (setq project-vc-extra-root-markers
	'(".projectile" ".project.el" "fpm.toml"))
  (setq project-key-prompt-style t) ; Emacs 30
  (advice-add #'project-switch-project
	      :after #'troi-common-clear-minibuffer-message))

#+end_src


** Diffs

You never know when you'll need a reminder of what exactly you changed.

#+begin_src emacs-lisp :tangle "new-init.el"
;; `ediff'

(use-package ediff
  :ensure nil
  :commands (ediff-buffers ediff-files ediff-buffers3 ediff-files3)

  :init
  (setq ediff-split-window-function 'split-window-horizontally)
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)

  :config
  (setq ediff-keep-variants nil)
  (setq ediff-make-buffers-readonly-at-startup nil)
  (setq ediff-merge-revisions-with-ancestor t)
  (setq ediff-show-clashes-only t))

;;;###autoload
(defun troi-common-clear-minibuffer-message (&rest _)
  "Print an empty message to clear the echo area.
Use this as advice :after a noisy function."
  (message ""))

;; `diff-mode'
(use-package diff-mode
  :ensure nil
  :defer t
  :config
  (setq diff-default-read-only t))

(use-package diff-hl
  :ensure t
  :config
  (global-diff-hl-mode))

#+end_src


