emacs/.config/emacs/new-init.el

;; Text display and editing.

(use-package isearch
  :ensure nil
  :demand t
  :config
  ;; "find one two" would find "one two" "one hi there two" etc.
  ;; one `setq' here to make it obvious these are a group.
  (setq search-whitespace-regexp ".*?"
        isearch-lax-whitespace t
        isearch-regexp-lax-whitespace nil)

  (setq isearch-lazy-count t)
  (setq isearch-lazy-highlight t)
  (setq isearch-repeat-on-direction-change t)
  (setq isearch-wrap-pause t)

  (setq search-highlight t)

  (setq lazy-count-prefix-format "(%s/%s) ")
  (setq lazy-count-suffix-format nil)
  (setq lazy-highlight-initial-delay 0.5)
  (setq lazy-highlight-no-delay-length 4)

  (add-hook 'occur-mode-hook #'hl-line-mode)

  ) ;; use-package isearch

(use-package re-builder
  :ensure nil
  :commands (re-builder regexp-builder)
  :config
  (setq reb-re-syntax 'read))

(use-package grep
  :ensure nil
  :after exec-path-from-shell
  :commands (grep lgrep rgrep)
  :config
  (setq grep-save-buffers nil)
  (setq grep-use-headings t) ; Emacs 30

  (let ((executable (or (executable-find "rg") "grep"))
        (rgp (string-match-p "rg" grep-program)))
    (setq grep-program executable)
    (setq grep-template
          (if rgp
              "/usr/bin/rg -nH --null -e <R> <F>"
            "/usr/bin/grep <X> <C> -nH --null -e <R> <F>"))
    (setq xref-search-program (if rgp 'ripgrep 'grep))))

;; wgrep (writable grep)
;; See the `grep-edit-mode' for the new built-in feature.

(unless (>= emacs-major-version 31)
  (use-package wgrep
    :ensure t
    :after grep
    :bind
    ( :map grep-mode-map
      ("e" . wgrep-change-to-wgrep-mode)
      ("C-x C-q" . wgrep-change-to-wgrep-mode)
      ("C-c C-c" . wgrep-finish-edit))
    :config
    (setq wgrep-auto-save-buffer t)
    (setq wgrep-change-readonly-file t)))

;; Text and other settings that haven't fit anywhere else yet.

;; Line widths. The `visual-fill-column' package 'narrows' the
;; display when you're using a single window on a wide screen so
;; if you are wrapping text it will wrap at the fill column and
;; not the edge of the screen.

(setq-default tab-width 8)
(setq-default indent-tabs-mode t)

(use-package visual-fill-column
  :ensure t
  :commands (visual-fill-column-mode))

;; visual line mode is OK for text, use (truncate-lines t) for
;; code.

(setq-default fill-column 70)
;; (add-hook 'text-mode-hook 'visual-line-mode)

;; More odds and ends.

(delete-selection-mode +1)
(indent-tabs-mode +1)
(setopt tab-always-indent 'complete)
(setopt comment-empty-lines t)
(setopt require-final-newline t)
(defalias 'yes-or-no-p 'y-or-n-p)

;; Parentheses (show-paren-mode)
(use-package paren
  :ensure nil
  :hook (prog-mode . show-paren-local-mode)
  :config
  (setq show-paren-style 'parenthesis)
  (setq show-paren-when-point-in-periphery nil)
  (setq show-paren-when-point-inside-paren nil)
  (setq show-paren-context-when-offscreen 'overlay)) ; Emacs 29

;; Plain text (text-mode)
(use-package text-mode
  :ensure nil
  :mode "\\`\\(README\\|CHANGELOG\\|COPYING\\|LICENSE\\)\\'"
  :hook
  (text-mode . turn-on-auto-fill)
  :config
  (setq sentence-end-double-space nil)
  (setq sentence-end-without-period nil)
  (setq colon-double-space nil)
  (setq use-hard-newlines nil)
  (setq adaptive-fill-mode t))

(use-package which-key
  :ensure nil
  :diminish
  :config (which-key-mode))

(use-package bind-key
  :ensure nil)

(use-package ws-butler
  :ensure t
  :diminish
  :hook (prog-mode . ws-butler-mode))

;; i often use C-l for visual breaks.

(use-package form-feed-st
  :diminish
  :hook
  (prog-mode . form-feed-st-mode)
  (text-mode . form-feed-st-mode))

(provide 'init)
;;; File init.el ends here.
